#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/gem-engineering/kubernetes-ops-stage-gem-backend/runs/run-YXNT6Rscax1UZMzS

Waiting for the plan to start...

Terraform v1.0.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "standard-application"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gem-backend"
      + namespace                  = "app-stage"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm-charts.managedkube.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                replicaCount: 1
                
                fullnameOverride: gem-backend
                namespace: app-stage
                
                # kick 3
                
                # containerSpecOptions:
                #   securityContext:
                #     runAsUser: 1000
                #     runAsGroup: 1000
                
                deployment:
                  containers:
                  - name: gem-backend
                    image:
                      repository: 067550988196.dkr.ecr.us-east-1.amazonaws.com/backend
                      tag: v1.2.2.2
                      pullPolicy: Always
                    args:
                    - run
                    env:
                      base:
                        - name: TXINDEX
                          value: "true"
                        - name: GLOG_V
                          value: "0"
                        - name: ADMIN_PUBLIC_KEYS
                          value: "BC1YLjUrkSFEW1XyfZ6JdbdVmDURFG3PxJmZ7LKw4zs6PCFLXKeM2YJ BC1YLfrvJwwAjDcL3Tq2spWbvXCJFadiDdJMyvCaeHgG7snSsYNRKXk BC1YLhKuj76oaT1wwGhfb9GX7rCyc9cxrx54v84fAn9EDuc9zDawgGf BC1YLh6WDX4uCw3pcT7pjEQG7UcLj1KS1SpG3hnLkWg11EiBGjAM6oP BC1YLfyqxLpXsiGt7HvgjaKBjCZjAev82HeM626Nw7zfuYowrY72fGP BC1YLhSkJo5dhiFK38eFdViXm1tsAVi1ZFdNroG1RoB8NJG4JnDLzNK BC1YLijaLPipTCt1rL8fx6Xxt1DGNrasqRsfhKPRihPneqbntpRCzQY"
                        - name: SUPER_ADMIN_PUBLIC_KEYS
                          value: "BC1YLjUrkSFEW1XyfZ6JdbdVmDURFG3PxJmZ7LKw4zs6PCFLXKeM2YJ BC1YLfrvJwwAjDcL3Tq2spWbvXCJFadiDdJMyvCaeHgG7snSsYNRKXk BC1YLhKuj76oaT1wwGhfb9GX7rCyc9cxrx54v84fAn9EDuc9zDawgGf BC1YLh6WDX4uCw3pcT7pjEQG7UcLj1KS1SpG3hnLkWg11EiBGjAM6oP BC1YLfyqxLpXsiGt7HvgjaKBjCZjAev82HeM626Nw7zfuYowrY72fGP BC1YLhSkJo5dhiFK38eFdViXm1tsAVi1ZFdNroG1RoB8NJG4JnDLzNK BC1YLijaLPipTCt1rL8fx6Xxt1DGNrasqRsfhKPRihPneqbntpRCzQY"
                        #- name: POSTGRES_URI
                        #  value: "postgres://foo:foo@foo:foo/foo"
                        - name: RATE_LIMIT_FEERATE
                          value: "0"
                        - name: MIN_FEERATE
                          value: "1000"
                        - name: STARTER_BITCLOUT_NANOS
                          value: "1000000"
                        - name: MIN_SATOSHIS_FOR_PROFILE
                          value: "50000"
                        - name: DATA_DIR
                          value: "/db"
                        - name: SQS_URI
                          value: "bar"
                      perEnv: [ ]
                    ports:
                    - name: http1
                      protocol: TCP
                      containerPort: 17000
                      servicePort: 17000
                    - name: http2
                      protocol: TCP
                      containerPort: 17001
                      servicePort: 17001
                
                    resources:
                      requests:
                        memory: 32Gi
                
                ingress:
                  enabled: true
                  annotations:
                    kubernetes.io/ingress.class: nginx-external
                    # kubernetes.io/tls-acme: "true"
                  paths:
                    - path: /api
                      servicePort: http2
                  hosts:
                    - api.stage.yourgem.app
                  tls: []
                  #  - secretName: chart-example-tls
                  #    hosts:
                  #      - chart-example.local
            EOT,
        ]
      + verify                     = false
      + version                    = "1.0.11"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @sekka1, Action: `pull_request`*